Repository: kodi-game/game.libretro.melonds
Catalog: game.libretro.melonds/resources/language/resource.language.*/strings.po
Languages: da_dk, de_de, es_es, ga, zh_cn

# Addon Summary
source: Nintendo - DS (melonDS)
zh_cn: 任天堂 - DS (melonDS)

# Addon Description
source: melonDS aims at providing fast and accurate Nintendo DS emulation.
da_dk: melonDS sigter mod at levere hurtig og præcis Nintendo DS-emulering.
de_de: melonDS zielt auf die schnelle und akkurate Nintendo DS Emulation ab.
es_es: El objetivo de melonDS es proporcionar una emulación de Nintendo DS rápida y precisa.
ga: Tá sé mar aidhm ag melonDS aithris Nintendo DS tapa agus cruinn a sholáthar.
zh_cn: melonDS 旨在提供快速精准的任天堂 DS 仿真。

# #30000
source: Settings
es_es: Ajustes
zh_cn: 设置

# #30001
source: Console Mode
da_dk: Konsoltilstand
de_de: Konsolenmodus
es_es: Modo Consola
ga: Mód Consóil
zh_cn: 控制台模式

# #30002
source: Boot Game Directly
da_dk: Boot spil direkte
de_de: Spiel direkt booten
es_es: Arrancar Juego Directamente
ga: Tosaigh Cluiche go Díreach
zh_cn: 直接引导游戏

# #30003
source: Use Firmware Settings
da_dk: Brug firmwareindstillinger
de_de: Firmwareeinstellungen verwenden
es_es: Utilizar la Configuración del Firmware
ga: Úsáid Socruithe Dochtearraí
zh_cn: 使用固件设置

# #30004
source: Language
da_dk: Sprog
de_de: Sprache
es_es: Idioma
ga: Teanga
zh_cn: 语言

# #30005
source: Randomize MAC Address
da_dk: Tilfældig MAC-adresse
de_de: Zufällige MAC-Adresse erzeugen
es_es: Dirección MAC Aleatoria
ga: Randamaigh Seoladh MAC
zh_cn: 随机 MAC 地址

# #30006
source: Enable DSi SD Card
da_dk: Aktiver DSi SD-kort
de_de: DSi-SD-Karte aktivieren
es_es: Activar Tarjeta SD de la DSi
ga: Cumasaigh Cárta SD DSi
zh_cn: 启用 DSi SD 卡

# #30007
source: Threaded Software Renderer
da_dk: Threaded software-rendering
de_de: Threaded-Rendering (Software)
es_es: Software Renderizador por Hilos
ga: Rindreálaí Bogearraí Snáithithe
zh_cn: 线程化软件渲染器

# #30008
source: OpenGL Renderer (Restart)
da_dk: OpenGL rendering (genstart)
de_de: OpenGL-Renderer (Neustart erforderlich)
es_es: Renderizador OpenGL (reinicio)
ga: Rindreálaí OpenGL (Atosaigh)
zh_cn: OpenGL 渲染器（重新启动）

# #30009
source: OpenGL Internal Resolution
da_dk: OpenGL intern opløsning
de_de: Interne OpenGL-Auflösung
es_es: Resolución Interna OpenGL
ga: Rún Inmheánach OpenGL
zh_cn: OpenGL 内部分辨率

# #30010
source: OpenGL Improved Polygon Splitting
da_dk: OpenGL forbedret polygonopdeling
de_de: OpenGL-verbesserte Polygontrennung
es_es: División de Polígonos OpenGL Mejorada
ga: Scoilteadh Polagán Feabhsaithe OpenGL
zh_cn: OpenGL 改进的多边形分割

# #30011
source: OpenGL Filtering
da_dk: OpenGL filtrering
de_de: OpenGL-Filterung
es_es: Filtrado OpenGL
ga: Scagadh OpenGL
zh_cn: OpenGL 过滤

# #30012
source: Microphone Input
da_dk: Mikrofonindgang
de_de: Mikrofoneingang
es_es: Entrada de Micrófono
ga: Ionchur Micreafóin
zh_cn: 麦克风输入

# #30013
source: Audio Bitrate
da_dk: Lydbitrate
es_es: Tasa de Bits de Audio
ga: Ráta Giotáin Fuaime
zh_cn: 音频比特率

# #30014
source: Audio Interpolation
da_dk: Lydinterpolation
es_es: Interpolación de Audio
ga: Idirshuíomh Fuaime
zh_cn: 音频插值

# #30015
source: Touch Mode
da_dk: Touchtilstand
de_de: Touch-Modus
es_es: Modo Táctil
ga: Mód Tadhaill
zh_cn: 触摸模式

# #30016
source: Swap Screen Mode
da_dk: Skift skærmtilstand
de_de: Bildschirmmodus wechseln
es_es: Cambiar Modo de Pantalla
ga: Mód Malartaithe Scáileáin
zh_cn: 交换屏幕模式

# #30017
source: Screen Layout
da_dk: Skærmlayout
de_de: Bildschirmlayout
es_es: Diseño de Pantalla
ga: Leagan Amach Scáileáin
zh_cn: 屏幕布局

# #30018
source: Screen Gap
da_dk: Skærmafstand
de_de: Bildschirmlücke
es_es: Separación entre Pantallas
ga: Bearna Scáileáin
zh_cn: 屏幕间隙

# #30019
source: Hybrid Small Screen Mode
da_dk: Hybridtilstand for lille skærm
de_de: Hybrider Modus für kleine Bildschirme
es_es: Modo Híbrido en Pantalla Pequeña
ga: Mód Scáileáin Bhig Hibrideach
zh_cn: 混合小屏幕模式

# #30020
source: Hybrid Ratio (OpenGL Only)
da_dk: Hybridforhold (kun OpenGL)
de_de: Hybrides Verhältnis (nur OpenGL)
es_es: Relación Híbrida (sólo OpenGL)
ga: Cóimheas Hibrideach (OpenGL Amháin)
zh_cn: 混合比率（仅 OpenGL）

# #30021
source: JIT Enable (Restart)
da_dk: Aktiver JIT (genstart)
de_de: JIT aktivieren (Neustart erforderlich)
es_es: Activar JIT (reinicio)
ga: Cumasaigh JIT (Atosaigh)
zh_cn: JIT 启用（重新启动）

# #30022
source: JIT Block Size
da_dk: JIT-blokstørrelse
de_de: JIT-Blockgröße
es_es: Tamaño de Bloque JIT
ga: Méid Bloc JIT
zh_cn: JIT 块大小

# #30023
source: JIT Branch Optimisations
da_dk: JIT optimeringer af branch
es_es: Optimización Ramificaciones JIT
ga: Uasmhéaduithe Brainse JIT
zh_cn: JIT 分支优化

# #30024
source: JIT Literal Optimisations
da_dk: JIT literale optimeringer
es_es: Optimizaciones Literales JIT
ga: Optamúcháin Litriúla JIT
zh_cn: JIT 文字优化

# #30025
source: JIT Fast Memory
da_dk: JIT hurtig hukommelse
es_es: Memoria Rápida JIT
ga: Cuimhne Thapa JIT
zh_cn: JIT 快速内存
